## Importing packages

In [137]:
import pandas as pd
import matplotlib.pyplot as plt
import json
import numpy as np

## Importing csv files

In [169]:
tmdbDataSet = pd.read_csv('tmdb_5000_movies.csv')
avocadoDataSet = pd.read_csv('avocado.csv')
del avocadoDataSet['Unnamed: 0'] # removing unwanted column from dataset

## Extract basic information about dataset

In [35]:
# Returning top 5 rows
print(tmdbDataSet.head())

      budget                                             genres  \
0  237000000  [{"id": 28, "name": "Action"}, {"id": 12, "nam...
1  300000000  [{"id": 12, "name": "Adventure"}, {"id": 14, "...
2  245000000  [{"id": 28, "name": "Action"}, {"id": 12, "nam...
3  250000000  [{"id": 28, "name": "Action"}, {"id": 80, "nam...
4  260000000  [{"id": 28, "name": "Action"}, {"id": 12, "nam...

                                       homepage      id  \
0                   http://www.avatarmovie.com/   19995
1  http://disney.go.com/disneypictures/pirates/     285
2   http://www.sonypictures.com/movies/spectre/  206647
3            http://www.thedarkknightrises.com/   49026
4          http://movies.disney.com/john-carter   49529

                                            keywords original_language  \
0  [{"id": 1463, "name": "culture clash"}, {"id":...                en
1  [{"id": 270, "name": "ocean"}, {"id": 726, "na...                en
2  [{"id": 470, "name": "spy"}, {"id": 818, "name...                en
3  [{"id": 849, "name": "dc comics"}, {"id": 853,...                en
4  [{"id": 818, "name": "based on novel"}, {"id":...                en

                             original_title  \
0                                    Avatar
1  Pirates of the Caribbean: At World's End
2                                   Spectre
3                     The Dark Knight Rises
4                               John Carter

                                            overview  popularity  \
0  In the 22nd century, a paraplegic Marine is di...  150.437577
1  Captain Barbossa, long believed to be dead, ha...  139.082615
2  A cryptic message from Bondâ€™s past sends him o...  107.376788
3  Following the death of District Attorney Harve...  112.312950
4  John Carter is a war-weary, former military ca...   43.926995

                                production_companies  \
0  [{"name": "Ingenious Film Partners", "id": 289...
1  [{"name": "Walt Disney Pictures", "id": 2}, {"...
2  [{"name": "Columbia Pictures", "id": 5}, {"nam...
3  [{"name": "Legendary Pictures", "id": 923}, {"...
4        [{"name": "Walt Disney Pictures", "id": 2}]

                                production_countries release_date     revenue  \
0  [{"iso_3166_1": "US", "name": "United States o...   2009-12-10  2787965087
1  [{"iso_3166_1": "US", "name": "United States o...   2007-05-19   961000000
2  [{"iso_3166_1": "GB", "name": "United Kingdom"...   2015-10-26   880674609
3  [{"iso_3166_1": "US", "name": "United States o...   2012-07-16  1084939099
4  [{"iso_3166_1": "US", "name": "United States o...   2012-03-07   284139100

   runtime                                   spoken_languages    status  \
0    162.0  [{"iso_639_1": "en", "name": "English"}, {"iso...  Released
1    169.0           [{"iso_639_1": "en", "name": "English"}]  Released
2    148.0  [{"iso_639_1": "fr", "name": "Fran\u00e7ais"},...  Released
3    165.0           [{"iso_639_1": "en", "name": "English"}]  Released
4    132.0           [{"iso_639_1": "en", "name": "English"}]  Released

                                          tagline  \
0                     Enter the World of Pandora.
1  At the end of the world, the adventure begins.
2                           A Plan No One Escapes
3                                 The Legend Ends
4            Lost in our world, found in another.

                                      title  vote_average  vote_count
0                                    Avatar           7.2       11800
1  Pirates of the Caribbean: At World's End           6.9        4500
2                                   Spectre           6.3        4466
3                     The Dark Knight Rises           7.6        9106
4                               John Carter           6.1        2124

In [ ]:
# Returning last row
print(tmdbDataSet.tail(1))

In [ ]:
# Getting info about dataset like clolumn types, count of not null values
print(tmdbDataSet.info())

In [ ]:
# Another way to check datatypes of the columns
print(tmdbDataSet.dtypes)

In [109]:
# Get all the columns in dataset
print(tmdbDataSet.columns)

Index(['budget', 'genres', 'homepage', 'id', 'keywords', 'original_language',
       'original_title', 'overview', 'popularity', 'production_companies',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'tagline', 'title', 'vote_average',
       'vote_count'],
      dtype='object')

In [ ]:
# Get the shape of dataset
print(tmdbDataSet.shape)

In [ ]:
# Get information like count, mean, std, min, 25%, 50%, 75% and max of dataset
print(tmdbDataSet.describe())

In [ ]:
# To calulate 55% of the dataset
print(tmdbDataSet.vote_count.quantile([0.55]))

In [ ]:
# output is same as that of above cell
temp = tmdbDataSet.sort_values(['vote_count']).head(2641)
print(temp.vote_count.tail(1))

In [ ]:
# To calculate median of the dataset
print(tmdbDataSet.median())

## Analyzing null values
As we observed that out of 4803 rows only 1712 are the not null values for the homepage column. Let's investigate it further and check why these column have null values

In [ ]:
tmdbDataSet[tmdbDataSet['homepage'].isnull()]

In [ ]:
# Check the unique values of the column 
print(tmdbDataSet.production_countries.value_counts())

In [88]:
print(tmdbDataSet.spoken_languages.value_counts(dropna=False))

NaN    4803
Name: spoken_languages, dtype: int64

In [ ]:
print(tmdbDataSet.release_date.value_counts(dropna=False))

## Converting data type of the column
As we have seen above that status column have only 3 distinct values. So it would be feasible to convert the column data type to category

In [ ]:
# Converting datatype of column to category
tmdbDataSet['status'] = tmdbDataSet['status'].astype('category')
print(tmdbDataSet.status.dtypes)

In [ ]:
# Command used to convert data type to numeric
# Note that below command will give an error while executing as string cannot be converted to numeric
tmdbDataSet['status'] = pd.to_numeric(tmdbDataSet['status'])

In [ ]:
# To forcefully convert column to numeric. It will insert NaN for the values it cannot convert to integer
pd.to_numeric(tmdbDataSet['status'], errors='coerce')

# Melting and pivoting of dataset

In [149]:
# Melting of dataset
avocadoDataSet_melt_4770 = pd.melt(avocadoDataSet, id_vars=['Date', 'AveragePrice', 'Total Volume', '4046', '4225',
       'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type', 'year',
       'region'], var_name='avocados_variety', value_name='4770')

avocadoDataSet_melt_4225 = pd.melt(avocadoDataSet_melt_4770, id_vars=['Date', 'AveragePrice', 'Total Volume', '4046',
       'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type', 'year',
       'region'], var_name='avocados_variety', value_name='4225')

avocadoDataSet_melt_4046 = pd.melt(avocadoDataSet_melt_4225, id_vars=['Date', 'AveragePrice', 'Total Volume',
       'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type', 'year',
       'region'], var_name='avocados_variety', value_name='4046')

print(avocadoDataSet_melt_4046.head())

         Date  AveragePrice  Total Volume  Total Bags  Small Bags  Large Bags  \
0  2015-12-27          1.33      64236.62     8696.87     8603.62       93.25
1  2015-12-20          1.35      54876.98     9505.56     9408.07       97.49
2  2015-12-13          0.93     118220.22     8145.35     8042.21      103.14
3  2015-12-06          1.08      78992.15     5811.16     5677.40      133.76
4  2015-11-29          1.28      51039.60     6183.95     5986.26      197.69

   XLarge Bags          type  year  region avocados_variety     4046
0          0.0  conventional  2015  Albany             4046  1036.74
1          0.0  conventional  2015  Albany             4046   674.28
2          0.0  conventional  2015  Albany             4046    794.7
3          0.0  conventional  2015  Albany             4046     1132
4          0.0  conventional  2015  Albany             4046   941.48

# Splitting columns

We can even split a single column into multiple column.

In [174]:
month = {1: 'JAN', 2: 'FEB', 3: 'MAR', 
         4: 'APR',5: 'MAY', 6: 'JUNE',7: 'JULY', 8: 'AUG', 9: 'SEP', 10: 'OCT', 11: 'NOV', 12: 'DEC' }
avocadoDataSet['Month'] = avocadoDataSet.Date.str.split('-').str.get(1)
avocadoDataSet['Month'] = pd.to_numeric(avocadoDataSet['Month'], errors='coerce')
avocadoDataSet['Month'] = avocadoDataSet['Month'].map(month)
print(avocadoDataSet.head())

         Date  AveragePrice  Total Volume     4046       4225    4770  \
0  2015-12-27          1.33      64236.62  1036.74   54454.85   48.16
1  2015-12-20          1.35      54876.98   674.28   44638.81   58.33
2  2015-12-13          0.93     118220.22   794.70  109149.67  130.50
3  2015-12-06          1.08      78992.15  1132.00   71976.41   72.58
4  2015-11-29          1.28      51039.60   941.48   43838.39   75.78

   Total Bags  Small Bags  Large Bags  XLarge Bags          type  year  \
0     8696.87     8603.62       93.25          0.0  conventional  2015
1     9505.56     9408.07       97.49          0.0  conventional  2015
2     8145.35     8042.21      103.14          0.0  conventional  2015
3     5811.16     5677.40      133.76          0.0  conventional  2015
4     6183.95     5986.26      197.69          0.0  conventional  2015

   region Month
0  Albany   DEC
1  Albany   DEC
2  Albany   DEC
3  Albany   DEC
4  Albany   NOV